name: "pre-process-drug-interaction"
max_batch_size: 100
backend: "python"
input[{
	name: "pre_process_input1"
    data_type: TYPE_STRING
	dims: [-1]
},
{
	name: "pre_process_input2"
    data_type: TYPE_STRING
	dims: [-1]
}
]
output[{
	name: "pre_process_output"
	data_type: TYPE_FP32
	dims: [ 64, 64, 1 ]
}
]
instance_group[{
	count: 5
	kind: KIND_CPU
}]

dynamic_batching{}